milestone2/results/rocks_db_benchmark_results5_wbs_512/readwrite_cache/output/benchmark_readrandom.t1.log
./db_bench --benchmarks=readrandom --use_existing_db=1 --db=/readwrite_cache/test-325346256/db --wal_dir=/readwrite_cache/test-325346256/wal --num=25000000 --disable_wal=true --num_levels=6 --key_size=20 --value_size=400 --block_size=8192 --cache_size=104857600 --cache_numshardbits=6 --compression_max_dict_bytes=0 --compression_ratio=0.5 --compression_type=none --level_compaction_dynamic_level_bytes=true --bytes_per_sync=8388608 --cache_index_and_filter_blocks=0 --pin_l0_filter_and_index_blocks_in_cache=1 --benchmark_write_rate_limit=0 --hard_rate_limit=3 --rate_limit_delay_max_milliseconds=1000000 --write_buffer_size=536870912 --target_file_size_base=134217728 --max_bytes_for_level_base=1073741824 --verify_checksum=1 --delete_obsolete_files_period_micros=62914560 --max_bytes_for_level_multiplier=8 --statistics=0 --stats_per_interval=1 --stats_interval_seconds=60 --histogram=1 --memtablerep=skip_list --bloom_bits=10 --open_files=-1 --level0_file_num_compaction_trigger=4 --level0_stop_writes_trigger=20 --max_background_compactions=16 --max_write_buffer_number=8 --max_background_flushes=7 --threads=1 --seed=1564882368 2>&1 | tee -a /readwrite_cache/test-325346256/output/benchmark_readrandom.t1.log
RocksDB:    version 6.1
Date:       Sun Aug  4 01:32:48 2019
CPU:        8 * Intel(R) Xeon(R) CPU E5-2673 v3 @ 2.40GHz
CPUCache:   30720 KB
2019/08/04-01:33:48  ... thread 0: (201000,201000) ops and (3345.5,3345.5) ops/second in (60.080200,60.080200) seconds

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L3     51/0    6.32 GB   6.3      9.2     7.9      1.3       6.3      5.0       0.0   0.8    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
  L5    252/0   31.60 GB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum    303/0   37.92 GB   0.0      9.2     7.9      1.3       6.3      5.0       0.0 6786576951.0    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
 Int      0/0    0.00 KB   0.0      9.2     7.9      1.3       6.3      5.0       0.0 6786576951.0    160.1    110.1     58.80             24.03         1   58.797     22M  7184K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      9.2     7.9      1.3       6.3      5.0       0.0   0.0    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
Uptime(secs): 60.3 total, 60.1 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 6.32 GB write, 107.41 MB/s write, 9.20 GB read, 156.26 MB/s read, 58.8 seconds
Interval compaction: 6.32 GB write, 107.73 MB/s write, 9.20 GB read, 156.72 MB/s read, 58.8 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 60.3 total, 60.1 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 MB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

2019/08/04-01:34:48  ... thread 0: (485000,686000) ops and (8078.7,5711.2) ops/second in (60.034783,120.114983) seconds

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L3      8/0   932.20 MB   0.9      9.2     7.9      1.3       6.3      5.0       0.0   0.8    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
  L4     31/0    3.90 GB   1.0      0.0     0.0      0.0       0.0      0.0       5.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L5    258/0   32.15 GB   0.0      3.8     1.5      2.3       2.8      0.6       0.0   1.9    104.4     78.0     37.05             10.42        12    3.088   9446K  2387K
 Sum    297/0   36.96 GB   0.0     13.0     9.4      3.6       9.1      5.6       5.4 9818067869.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
 Int      0/0    0.00 KB   0.0      3.8     1.5      2.3       2.8      0.6       5.4 3031490918.0    104.4     78.0     37.05             10.42        12    3.088   9446K  2387K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     13.0     9.4      3.6       9.1      5.6       0.0   0.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
Uptime(secs): 120.3 total, 60.0 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 9.14 GB write, 77.84 MB/s write, 12.97 GB read, 110.44 MB/s read, 95.8 seconds
Interval compaction: 2.82 GB write, 48.16 MB/s write, 3.78 GB read, 64.44 MB/s read, 37.1 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 120.3 total, 60.0 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 MB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

2019/08/04-01:35:48  ... thread 0: (1177000,1863000) ops and (19614.4,10343.0) ops/second in (60.006824,180.121807) seconds

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L3      8/0   932.20 MB   0.9      9.2     7.9      1.3       6.3      5.0       0.0   0.8    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
  L4     31/0    3.90 GB   1.0      0.0     0.0      0.0       0.0      0.0       5.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L5    258/0   32.15 GB   0.0      3.8     1.5      2.3       2.8      0.6       0.0   1.9    104.4     78.0     37.05             10.42        12    3.088   9446K  2387K
 Sum    297/0   36.96 GB   0.0     13.0     9.4      3.6       9.1      5.6       5.4 9818067869.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     13.0     9.4      3.6       9.1      5.6       0.0   0.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
Uptime(secs): 180.3 total, 60.0 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 9.14 GB write, 51.93 MB/s write, 12.97 GB read, 73.68 MB/s read, 95.8 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 180.3 total, 60.0 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 MB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

2019/08/04-01:36:48  ... thread 0: (1639000,3502000) ops and (27311.9,14583.6) ops/second in (60.010532,240.132339) seconds

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L3      8/0   932.20 MB   0.9      9.2     7.9      1.3       6.3      5.0       0.0   0.8    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
  L4     31/0    3.90 GB   1.0      0.0     0.0      0.0       0.0      0.0       5.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L5    258/0   32.15 GB   0.0      3.8     1.5      2.3       2.8      0.6       0.0   1.9    104.4     78.0     37.05             10.42        12    3.088   9446K  2387K
 Sum    297/0   36.96 GB   0.0     13.0     9.4      3.6       9.1      5.6       5.4 9818067869.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     13.0     9.4      3.6       9.1      5.6       0.0   0.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
Uptime(secs): 240.3 total, 60.0 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 9.14 GB write, 38.96 MB/s write, 12.97 GB read, 55.28 MB/s read, 95.8 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 240.3 total, 60.0 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 MB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

2019/08/04-01:37:48  ... thread 0: (2412000,5914000) ops and (40186.1,19703.3) ops/second in (60.020713,300.153052) seconds

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L3      8/0   932.20 MB   0.9      9.2     7.9      1.3       6.3      5.0       0.0   0.8    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
  L4     31/0    3.90 GB   1.0      0.0     0.0      0.0       0.0      0.0       5.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L5    258/0   32.15 GB   0.0      3.8     1.5      2.3       2.8      0.6       0.0   1.9    104.4     78.0     37.05             10.42        12    3.088   9446K  2387K
 Sum    297/0   36.96 GB   0.0     13.0     9.4      3.6       9.1      5.6       5.4 9818067869.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     13.0     9.4      3.6       9.1      5.6       0.0   0.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
Uptime(secs): 300.3 total, 60.0 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 9.14 GB write, 31.18 MB/s write, 12.97 GB read, 44.23 MB/s read, 95.8 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 300.3 total, 60.0 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 MB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

2019/08/04-01:38:48  ... thread 0: (3702000,9616000) ops and (61696.0,26699.5) ops/second in (60.003911,360.156963) seconds

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L3      8/0   932.20 MB   0.9      9.2     7.9      1.3       6.3      5.0       0.0   0.8    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
  L4     31/0    3.90 GB   1.0      0.0     0.0      0.0       0.0      0.0       5.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L5    258/0   32.15 GB   0.0      3.8     1.5      2.3       2.8      0.6       0.0   1.9    104.4     78.0     37.05             10.42        12    3.088   9446K  2387K
 Sum    297/0   36.96 GB   0.0     13.0     9.4      3.6       9.1      5.6       5.4 9818067869.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     13.0     9.4      3.6       9.1      5.6       0.0   0.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
Uptime(secs): 360.3 total, 60.0 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 9.14 GB write, 25.98 MB/s write, 12.97 GB read, 36.87 MB/s read, 95.8 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 360.3 total, 60.0 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 MB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

2019/08/04-01:39:48  ... thread 0: (5053000,14669000) ops and (84213.5,34913.0) ops/second in (60.002288,420.159251) seconds

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L3      8/0   932.20 MB   0.9      9.2     7.9      1.3       6.3      5.0       0.0   0.8    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
  L4     31/0    3.90 GB   1.0      0.0     0.0      0.0       0.0      0.0       5.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L5    258/0   32.15 GB   0.0      3.8     1.5      2.3       2.8      0.6       0.0   1.9    104.4     78.0     37.05             10.42        12    3.088   9446K  2387K
 Sum    297/0   36.96 GB   0.0     13.0     9.4      3.6       9.1      5.6       5.4 9818067869.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     13.0     9.4      3.6       9.1      5.6       0.0   0.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
Uptime(secs): 420.3 total, 60.0 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 9.14 GB write, 22.28 MB/s write, 12.97 GB read, 31.60 MB/s read, 95.8 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 420.3 total, 60.0 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 MB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

2019/08/04-01:40:48  ... thread 0: (5844000,20513000) ops and (97389.3,42720.7) ops/second in (60.006578,480.165829) seconds

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L3      8/0   932.20 MB   0.9      9.2     7.9      1.3       6.3      5.0       0.0   0.8    160.1    110.1     58.80             24.03         1   58.797     22M  7184K
  L4     31/0    3.90 GB   1.0      0.0     0.0      0.0       0.0      0.0       5.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L5    258/0   32.15 GB   0.0      3.8     1.5      2.3       2.8      0.6       0.0   1.9    104.4     78.0     37.05             10.42        12    3.088   9446K  2387K
 Sum    297/0   36.96 GB   0.0     13.0     9.4      3.6       9.1      5.6       5.4 9818067869.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     13.0     9.4      3.6       9.1      5.6       0.0   0.0    138.6     97.7     95.85             34.45        13    7.373     32M  9571K
Uptime(secs): 480.3 total, 60.0 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 9.14 GB write, 19.49 MB/s write, 12.97 GB read, 27.66 MB/s read, 95.8 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 0 level0_numfiles, 0 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 0 memtable_compaction, 0 memtable_slowdown, interval 0 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 480.3 total, 60.0 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 MB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     400 bytes each (200 bytes after compression)
Entries:    25000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    10013.6 MB (estimated)
FileSize:   5245.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
------------------------------------------------
DB path: [/readwrite_cache/test-325346256/db]
readrandom   :      20.942 micros/op 47750 ops/sec;   16.5 MB/s (21614001 of 25000000 found)

Microseconds per read:
Count: 25000000 Average: 20.9422  StdDev: 148.31
Min: 0  Median: 8.7113  Max: 350177
Percentiles: P50: 8.71 P75: 11.59 P99: 337.63 P99.9: 548.44 P99.99: 3430.09
------------------------------------------------------
[       0,       1 ]  1531085   6.124%   6.124% #
(       1,       2 ]  1491874   5.967%  12.092% #
(       2,       3 ]   178877   0.716%  12.807% 
(       3,       4 ]   121944   0.488%  13.295% 
(       4,       6 ]   144975   0.580%  13.875% 
(       6,      10 ] 13324015  53.296%  67.171% ###########
(      10,      15 ]  6161741  24.647%  91.818% #####
(      15,      22 ]   902096   3.608%  95.426% #
(      22,      34 ]   249996   1.000%  96.426% 
(      34,      51 ]   174476   0.698%  97.124% 
(      51,      76 ]    64785   0.259%  97.383% 
(      76,     110 ]    10148   0.041%  97.424% 
(     110,     170 ]     6958   0.028%  97.452% 
(     170,     250 ]    34538   0.138%  97.590% 
(     250,     380 ]   522912   2.092%  99.682% 
(     380,     580 ]    64807   0.259%  99.941% 
(     580,     870 ]     7567   0.030%  99.971% 
(     870,    1300 ]     2290   0.009%  99.980% 
(    1300,    1900 ]     1078   0.004%  99.985% 
(    1900,    2900 ]      927   0.004%  99.988% 
(    2900,    4400 ]     1163   0.005%  99.993% 
(    4400,    6600 ]      402   0.002%  99.995% 
(    6600,    9900 ]      146   0.001%  99.995% 
(    9900,   14000 ]       65   0.000%  99.995% 
(   14000,   22000 ]      163   0.001%  99.996% 
(   22000,   33000 ]      197   0.001%  99.997% 
(   33000,   50000 ]      511   0.002%  99.999% 
(   50000,   75000 ]       80   0.000%  99.999% 
(   75000,  110000 ]       92   0.000% 100.000% 
(  110000,  170000 ]       33   0.000% 100.000% 
(  170000,  250000 ]       43   0.000% 100.000% 
(  250000,  380000 ]       16   0.000% 100.000%